Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To get hold of these, simply query the extension context object for given key. Note that these metadata are made available as build proceeds, which means that extensions can only leverage metadata that were built before the extensions are invoked. If your extension attempts to retrieve metadata that wasn't yet produced, `null` will be returned. Here is a summary of which extensions can access which metadata:
ja_jp: これらを取得するには、指定されたキーのエクステンションコンテキストオブジェクトをクエリするだけです。これらのメタデータはビルドの進行とともに利用可能になるため、エクステンションは、エクステンションが呼び出される前にビルドされたメタデータのみを活用できることに注意してください。エクステンションがまだ生成されていないメタデータを取得しようとすると、`null` が返されます。どのエクステンションがどのメタデータにアクセスできるかを次に示します。

source: To get it to work you need to add a Java option to ensure the logging is initialized properly, i.e.
ja_jp: これを動作させるためには、ロギングが適切に初期化されるように Java オプションを追加する必要があります。

source: To get runtime profiling information out of the native executable, simply do:
ja_jp: 実行時プロファイリング情報をネイティブ実行可能ファイルから取得するには、単純に次のようにします。

source: To get started quickly copy the PMML file from the {quickstarts-tree-url}/kogito-pmml-quickstart/src/main/resources/LogisticRegressionIrisData.pmml[quickstart].
ja_jp: すぐに始めるには、 {quickstarts-tree-url}/kogito-pmml-quickstart/src/main/resources/LogisticRegressionIrisData.pmml[quickstart] からPMMLファイルをコピーしてください。

source: To get started quickly copy the process definition from the {quickstarts-tree-url}/kogito-quickstart/src/main/resources/org/acme/kogito/persons.bpmn2[quickstart]
ja_jp: 簡単に開始するには、{quickstarts-tree-url}/kogito-quickstart/src/main/resources/org/acme/kogito/persons.bpmn2[quickstart]からプロセス定義をコピーします。

source: To get started quickly you may copy the DMN model definition file from the {quickstarts-tree-url}/kogito-dmn-quickstart/src/main/resources/pricing.dmn[quickstart]
ja_jp: すぐに始めるには、DMNモデル定義ファイルを{quickstarts-tree-url}/kogito-quickstart/src/main/resources/pricing.dmn[quickstart]からコピーすることも出来ます。

source: To get started using Hibernate ORM with Panache and Kotlin, you can, generally, follow the steps laid out in the Java tutorial. The biggest change to configuring your project is the Quarkus artifact to include. You can, of course, keep the Java version if you need but if all you need are the Kotlin APIs then include the following dependency instead:
ja_jp: KotlinでHibernate ORM with Panacheを使い始めるには、一般的には、Javaチュートリアルで説明されている手順に従います。プロジェクトを設定する上で最も大きな変更点は、インクルードするQuarkusのアーティファクトです。もちろん、必要であればJavaバージョンのままでも構いませんが、KotlinのAPIだけが必要な場合は、代わりに以下の依存関係をインクルードしてください。

source: To get started using MongoDB with Panache with Kotlin, you can, generally, follow the steps laid out in the Java tutorial. The biggest change to configuring your project is the Quarkus artifact to include. You can, of course, keep the Java version if you need but if all you need are the Kotlin APIs then include the following dependency instead:
ja_jp: MongoDB with PanacheをKotlinで使い始めるには、一般的にはJavaのチュートリアルで説明した手順を踏むことができます。プロジェクトの設定で最も大きな変更点は、インクルードするQuarkusのアーティファクトです。もちろん、必要であればJavaバージョンを残すこともできますが、Kotlin APIだけが必要であれば、代わりに以下の依存関係をインクルードします。

source: To get started with form authentication, you should have similar settings as described in xref:security-basic-authentication-howto.adoc[Enable Basic authentication] and property `quarkus.http.auth.form.enabled` must be set to `true`.
ja_jp: フォーム認証を開始するには、xref:security-basic-authentication-howto.adoc[Basic 認証を有効にする] で説明されているのと同様の設定が必要であり、 `quarkus.http.auth.form.enabled` プロパティーを `true` に設定する必要があります。

source: To get started with security in Quarkus, consider combining the Quarkus built-in Basic HTTP authentication with the Jakarta Persistence identity provider to enable role-based access control (RBAC).
ja_jp: Quarkusでセキュリティを始めるには、Quarkusに組み込まれているBasic HTTP認証とJakarta Persistence IDプロバイダーを組み合わせて、ロールベースのアクセス制御（RBAC）を有効にすることを検討してください。

source: To get started with security in Quarkus, consider combining the Quarkus built-in xref:security-basic-authentication.adoc[Basic authentication] with the Jakarta Persistence identity provider to enable role-based access control (RBAC). Complete the steps in the xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication] tutorial.
ja_jp: Quarkusのセキュリティに入門するには、Quarkusに組み込まれている xref:security-basic-authentication.adoc[Basic認証] とJakarta Persistence IDプロバイダーを組み合わせて、ロールベースのアクセス制御（RBAC）を有効にすることを検討してください。 xref:security-basic-authentication-tutorial.adoc[Quarkus アプリケーションをBasic認証で保護] するチュートリアルの手順を完了してください。

source: To get started with security in Quarkus, consider securing your Quarkus application endpoints with the built-in Quarkus xref:security-basic-authentication.adoc[Basic authentication] and the Jakarta Persistence identity provider and enabling role-based access control.
ja_jp: Quarkusのセキュリティに入門するには、組込のQuarkus xref:security-basic-authentication.adoc[Basic認証] とJakarta Persistence IDプロバイダを使用してQuarkusアプリケーションのエンドポイントを保護し、ロールベースのアクセス制御を有効にすることを検討してください。

source: To get started with security in Quarkus, we recommend that you first combine the Quarkus built-in xref:security-basic-auth-concept.adoc[Basic HTTP authentication] with the JPA identity provider to enable role-based access control (RBAC). Complete the steps in the xref:security-getting-started.adoc[Secure a Quarkus application with Basic authentication] tutorial. After you have successfully secured your Quarkus application with basic HTTP authentication, you can increase the security further by adding more advanced authentication mechanisms, for example, OpenID Connect (OIDC) authentication.
ja_jp: Quarkusのセキュリティに入門するには、まず、Quarkusに組み込まれている link:security-basic-auth-concept.html[Basic HTTP認証] とJPA IDプロバイダーを組み合わせて、ロールベースのアクセス制御（RBAC）を有効にすることをお勧めします。 link:security-getting-started.html[QuarkusアプリケーションのBasic認証による保護] チュートリアルのステップを完了してください。QuarkusアプリケーションのBasic HTTP認証による保護が出来たら、OpenID Connect（OIDC）認証など、より高度な認証メカニズムを追加して、セキュリティをさらに高めることができます。

source: To get started, create a new project by using the following command:
ja_jp: 最初に、次のコマンドを使用して新しいプロジェクトを作成します。

source: To get started:
ja_jp: 始めるには:

source: To get the full power of the reactive nature of the client, you can use the non-blocking flavor of REST Client Reactive extension, which comes with support for `CompletionStage` and `Uni`. Let's see it in action by adding a `getByIdAsync` method in our `ExtensionsService` REST interface. The code should look like:
ja_jp: クライアントのリアクティブな性質を最大限に活用するには、REST Client Reactive エクステンションのノンブロッキングフレーバーを使用するとよいでしょう。このエクステンションは `CompletionStage` と `Uni` をサポートしています。それでは、実際に `ExtensionsService` REST インターフェイスに `getByIdAsync` メソッドを追加して、この動きを見てみましょう。コードは以下のようになります。

source: To get the full power of the reactive nature of the client, you can use the non-blocking flavor of REST Client extension, which comes with support for `CompletionStage` and `Uni`. Let's see it in action by adding a `getByIdAsync` method in our `ExtensionsService` REST interface. The code should look like:
ja_jp: クライアントのリアクティブな性質を最大限に活用するには、REST Client エクステンションのノンブロッキングフレーバーを使用します。 このエクステンションは `CompletionStage` と `Uni` をサポートしています。 それでは、実際に `ExtensionsService` REST インターフェイスに `getByIdAsync` メソッドを追加して、この動きを見てみましょう。コードは以下のようになります。

source: To get the log output for your application's pod, enter the following command:
ja_jp: アプリケーションのポッドのログ出力を取得するには、次のコマンドを入力します：

source: To get the log output for your application's pod, run the following command where `__<pod_name>__` is the name of the latest pod prefixed with the name of your application:
ja_jp: アプリケーションの Pod のログ出力を取得するには、`__<pod_name>__` (アプリケーション名の前に付加された最新の Pod の名前) を指定して次のコマンドを実行します:

source: To get the log output for your application's pod, run the following command, replacing `<pod_name>` with the name of the latest pod prefixed by your application name:
ja_jp: アプリケーションのポッドのログ出力を取得するには、次のコマンドを実行します。 `<pod_name>` を最新のポッドの名前に置き換え、その前にアプリケーション名を付けます：

source: To get the log output for your application's pod, use the `oc logs -f` command with its name. The following example uses the `openshift-helloworld-1-gzzrx` pod name, which corresponds to the latest pod prefixed with the name of your application:
ja_jp: アプリケーションのポッドのログ出力を取得するには、 `oc logs -f` コマンドにポッド名を指定します。次の例では、 `openshift-helloworld-1-gzzrx` というポッド名を使用しています。これは、アプリケーションの名前の前に最新のポッドを付けたものです：

source: To get your library working properly with virtual threads, you should make sure the library is not pinning the carrier thread. Quarkus has xref:virtual-threads.adoc#testing-virtual-thread-applications[test helpers to do these checks in an automated way]. For dispatching work, you should use the xref:virtual-threads.adoc#inject-the-virtual-thread-executor[virtual executor managed by Quarkus]. The link:https://quarkus.io/extensions/io.quarkus/quarkus-websockets-next/[WebSockets-next extension] uses the virtual dispatcher and smart dispatch, and is a good example to follow.
ja_jp: ライブラリーを仮想スレッドで適切に動作させるには、ライブラリーがキャリアースレッドを固定していないことを確認する必要があります。 Quarkus には、xref:virtual-threads.adoc#testing-virtual-thread-applications[これらのチェックを自動的に行うためのテストヘルパー] があります。 ディスパッチ作業には、xref:virtual-threads.adoc#inject-the-virtual-thread-executor[Quarkus によって管理される仮想エグゼキューター] を使用する必要があります。link:https://quarkus.io/extensions/io.quarkus/quarkus-websockets-next/[WebSockets-next エクステンション] は、仮想ディスパッチャーとスマートディスパッチを使用しており、参考にするのに適した例です。

source: To give you an idea of the impact, in our sample large application, **this change alone reduced the build time from two minutes down to 37 seconds**.
ja_jp: その影響のアイデアを示すと、私たちのサンプル大規模アプリケーションでは、**この変更だけでビルド時間が2分から37秒に短縮されました**。

source: To handle HTTP requests that have `multipart/form-data` as their content type, RESTEasy Reactive introduces the link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/MultipartForm.html[`@MultipartForm`] annotation. Let us look at an example of its use.
ja_jp: RESTEasy Reactive は、コンテンツタイプとして `multipart/form-data` を持つ HTTP リクエストを処理するために、 link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/MultipartForm.html[`@MultipartForm`] アノテーションを導入しています。その使用例を見てみましょう。

source: To handle HTTP requests that have `multipart/form-data` as their content type, you can use the regular link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] annotation, but we have special types that allow you to access the parts as files or as entities. Let us look at an example of its use.
ja_jp: コンテンツタイプが `multipart/form-data` の HTTP リクエストを処理するために、通常の link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] アノテーションを使うことができますが、パーツをファイルとして、あるいはエンティティーとしてアクセスできる特別な型があります。その使用例を見てみましょう。

source: To handle this, you can disable the built-in exception mapper:
ja_jp: これを処理するには、組み込みの例外マッパーを無効にできます。

source: To have Hibernate Search work with an OpenSearch cluster instead, link:{hibernate-search-doc-prefix}#backend-elasticsearch-configuration-version[prefix the configured version with `opensearch:`], as shown below.
ja_jp: Hibernate Search を OpenSearch クラスタで動作させるには次のように link:{hibernate-search-doc-prefix}#backend-elasticsearch-configuration-version[指定したバージョン番号の前に `opensearch:`] を付けます。

source: To have Hibernate Search work with an OpenSearch cluster instead, link:{hibernate-search-docs-url}#backend-elasticsearch-configuration-version[prefix the configured version with `opensearch:`], as shown below.
ja_jp: 代わりに Hibernate Search を OpenSearch クラスターで動作させるには、 link:{hibernate-search-docs-url}#backend-elasticsearch-configuration-version[設定されたバージョンに `opensearch:` を接頭辞として付けます]。 以下に例を示します。

source: To have OpenShift generate a serving certificate, annotate an existing _Service_ object. The generated certificate will be stored in a secret, which you can then mount in your pod.
ja_jp: OpenShift でサービス証明書を生成するには、既存の _Service_ オブジェクトにアノテーションを付けます。 生成された証明書はシークレットに保存され、Pod にマウントできるようになります。

source: To have Quarkus support secure connections, you must either provide a certificate and associated key file, or supply a keystore.
ja_jp: Quarkusで安全な接続をサポートするには、証明書と関連するキーファイルを提供するか、キーストアを提供する必要があります。

source: To have your extension appear in the Dev UI, ensure the `quarkus-extension.yaml` file is present in the `src/main/resources/META-INF` directory of your extension's *runtime* module. This file provides metadata that the Dev UI uses to generate the extension card.
ja_jp: エクステンションが Dev UI に表示されるようにするには、エクステンションの *runtime* モジュールの `src/main/resources/META-INF` ディレクトリに `quarkus-extension.yaml` ファイルが存在することを確認してください。このファイルは、Dev UI がエクステンションカードを生成するために使用するメタデータを提供します。

source: To help you decide, see the content type descriptions in xref:doc-reference.adoc#titles-and-headings[Titles and headings] on the "About Quarkus documentation" page.
ja_jp: 決定するには、Quarkus ドキュメントについてページの xref:doc-reference.adoc#titles-and-headings[タイトルと見出し] にあるコンテンツタイプの説明を参照してください。

source: To help you decide, see the content type descriptions in xref:{doc-guides}/doc-reference.adoc#titles-and-headings[Titles and headings] on the "About Quarkus documentation" page.
ja_jp: 判断材料として、「Quarkusのドキュメントについて」ページの link:{doc-guides}/doc-reference.html#titles-and-headings[タイトルと見出し] のコンテンツタイプの説明をご覧ください。

source: To help you select the suitable API for you, here are some recommendations:
ja_jp: 適切な API を選択できるように、いくつかの推奨事項を以下に示します。

source: To implement a custom codec, you must provide a CDI bean implementing:
ja_jp: カスタムコーデックを実装するには、以下を実装する CDI Bean を提供する必要があります。

source: To implement a gRPC service using the Mutiny API, create a class that implements the service interface. Then, implement the methods defined in the service interface. If you don't want to implement a service method just throw an `java.lang.UnsupportedOperationException` from the method body (the exception will be automatically converted to the appropriate gRPC exception). Finally, implement the service and add the `@GrpcService` annotation:
ja_jp: Mutiny APIを使ってgRPCサービスを実装するには、サービスインターフェースを実装したクラスを作成します。そして、サービスインターフェースで定義されているメソッドを実装します。サービスメソッドを実装したくない場合は、メソッドボディから `java.lang.UnsupportedOperationException` を投げてください（例外は適切な gRPCの例外に自動的に変換されます）。最後に、サービスを実装し、 `@GrpcService` アノテーションを追加します。

source: To implement a gRPC service using the default gRPC API, create a class that extends the default implementation base. Then, override the methods defined in the service interface. Finally, implement the service and add the `@GrpcService` annotation:
ja_jp: デフォルトのgRPC APIを使ってgRPCサービスを実装するには、デフォルトの実装ベースを拡張したクラスを作成します。次に、サービス・インターフェースで定義されているメソッドを上書きします。最後に、サービスを実装し、 `@GrpcService` アノテーションを追加します。

source: To implement a test profile we need to implement `io.quarkus.test.junit.QuarkusTestProfile`:
ja_jp: テスト プロファイルを実装するには、 `io.quarkus.test.junit.QuarkusTestProfile` を実装する必要があります:

source: To implement this process, you need the following approach:
ja_jp: このプロセスを実装するには、次のアプローチが必要です。

source: To implement your Load Balancer Provider, make sure your project depends on Core and Configuration Generator. The former brings classes necessary to implement custom load balancer, the latter contains an annotation processor that generates classes needed by Stork.
ja_jp: ロードバランサープロバイダーを実装するには、プロジェクトが Core と Configuration Generator に依存していることを確認してください。前者はカスタムロードバランサーの実装に必要なクラスを提供し、後者はStorkが必要とするクラスを生成するアノテーションプロセッサを含んでいます。

source: To implement your Service Discovery Provider, make sure your project depends on Core and Configuration Generator. The former brings classes necessary to implement custom discovery, the latter contains an annotation processor that generates classes needed by Stork.
ja_jp: サービス ディスカバリー プロバイダーを実装するには、プロジェクトが Core と Configuration Generator に依存していることを確認してください。前者はカスタムディスカバリーの実装に必要なクラスを提供し、後者はStorkが必要とするクラスを生成するアノテーションプロセッサを含んでいます。

source: To import a custom realm file into Keycloak before running the tests, configure `Dev services for Keycloak` as shown:
ja_jp: テストを実行する前にカスタムレルムファイルを Keycloak にインポートするには、次のように `Dev services for Keycloak` を設定します。

source: To import the CSV files, we need the following cypher script which will import the data within the CSV files and create graph database nodes and edges:
ja_jp: CSVファイルをインポートするためには、CSVファイル内のデータをインポートし、グラフデータベースのノードとエッジを作成する以下のcypherスクリプトが必要です。

source: To improve user experience, Quarkus registers the three Jackson https://github.com/FasterXML/jackson-modules-java8[Java 8 modules] so you don't need to do it manually.
ja_jp: ユーザーエクスペリエンスを向上させるために、Quarkusは3つのJackson link:https://github.com/FasterXML/jackson-modules-java8[Java 8モジュール] を登録しているので、手動で登録する必要はありません。

source: To improve user experience, Quarkus registers the three Jackson https://github.com/FasterXML/jackson-modules-java8[Java 8 modules], so you do not need to do it manually.
ja_jp: ユーザーエクスペリエンスを向上させるために、Quarkus は 3 つの Jackson https://github.com/FasterXML/jackson-modules-java8[Java 8 モジュール] を登録しているので、手動で登録する必要はありません。

source: To include more resources in the native executable, the easiest way is to use the `quarkus.native.resources.includes` configuration property, and its counterpart to exclude resources `quarkus.native.resources.excludes`.
ja_jp: より多くのリソースをネイティブ実行可能ファイルに含めるには、 `quarkus.native.resources.includes` という設定プロパティーと、 `quarkus.native.resources.excludes` リソースを除外するための `quarkus.native.resources.excludes` を使用するのが最も簡単です。

source: To include more resources in the native executable, the easiest way is to use the `quarkus.native.resources.includes` configuration property. The configuration property supports glob patterns.
ja_jp: ネイティブ実行可能ファイルにより多くのリソースを含めるには、 `quarkus.native.resources.includes` 設定プロパティーを使用するのが最も簡単な方法です。この設定プロパティーは glob パターンをサポートします。

source: To include only a specific config group:
ja_jp: 特定のコンフィググループのみを含める場合:

source: To include the generated configuration reference documentation in a guide, use:
ja_jp: 生成された設定リファレンスドキュメントをガイドに含めるには、次のようにします:

source: To increment a value, run the following command:
ja_jp: 値をインクリメントするには、以下のコマンドを実行します:

source: To index a new Author, retrieve the session's indexing plan and call `add`, passing the author instance in argument.
ja_jp: 新しい Authorのインデックスを作成するには、セッションのインデックスプランを取得し、author のインスタンスを引数に渡して `add` を呼び出します。

source: To initialize the database with users and roles, implement the `Startup` class, as outlined in the following code snippet:
ja_jp: データベースをユーザーとロールで初期化するには、次のコードで説明するように `Startup` クラスを実装します:

source: To inject the `SearchSession` of a named persistence unit (`users` in our example), just add a qualifier:
ja_jp: 名前付き永続化ユニット(この例では `users` )の `SearchSession` を注入するには、修飾子を追加するだけです。

source: To inspect an HTTP upgrade, you must provide a CDI bean implementing the `io.quarkus.websockets.next.HttpUpgradeCheck` interface. Quarkus calls the `HttpUpgradeCheck#perform` method on every HTTP request that should be upgraded to a WebSocket connection. Inside this method, you can perform any business logic and/or reject the HTTP upgrade.
ja_jp: HTTP アップグレードを検査するには、 `io.quarkus.websockets.next.HttpUpgradeCheck` インターフェイスを実装する CDI Bean を提供する必要があります。 Quarkus は、WebSocket 接続にアップグレードする必要があるすべての HTTP リクエストに対して `HttpUpgradeCheck#perform` メソッドを呼び出します。 このメソッド内では、任意のビジネスロジックを実行したり、HTTP アップグレードを拒否したりできます。

source: To install Qute Web, follow xref:qute.adoc#serving-templates[the instructions].
ja_jp: Qute Web をインストールするには、xref:qute.adoc#serving-templates[手順] に従ってください。

source: To install the PostgreSQL driver dependency for instance, run the following command:
ja_jp: PostgreSQL ドライバーの依存関係をインスタンスにインストールするには、以下のコマンドを実行します。

source: To install the Quarkus CLI using Chocolatey, run the following command:
ja_jp: Chocolatey を使用して Quarkus CLI をインストールするには、次のコマンドを実行します。

source: To install the Quarkus CLI using Homebrew, run the following command:
ja_jp: Homebrew を使用して Quarkus CLI をインストールするには、次のコマンドを実行します。

source: To install the Quarkus CLI using SDKMAN!, run the following command:
ja_jp: SDKMAN! を使用して Quarkus CLI をインストールするには、次のコマンドを実行します。

source: To install the Quarkus CLI using Scoop, run the following command:
ja_jp: Scoop を使用して QuarkusCLI をインストールするには、次のコマンドを実行します。

source: To integrate Mutiny and RESTEasy, you need to add the `quarkus-resteasy-mutiny` dependency to your project:
ja_jp: Mutiny と RESTEasy を統合するには、 `quarkus-resteasy-mutiny` 依存関係をプロジェクトに追加する必要があります。

source: To introspect the JWT tokens remotely, you can use `quarkus-oidc` or `quarkus-elytron-security-oauth2` for verifying the opaque or binary tokens by using remote introspection. `quarkus-smallrye-jwt` does not support the remote introspection of both opaque or JWT tokens but instead relies on the locally available keys that are usually retrieved from the OpenID Connect provider.
ja_jp: JWT トークンをリモートでイントロスペクトするには、 `quarkus-oidc` を使用できます。 または `quarkus-elytron-security-oauth2` リモートイントロスペクションを使用して不透明トークンまたはバイナリートークンを検証します。 `quarkus-smallrye-jwt` は、不透明トークンと JWT トークンの両方のリモートイントロスペクションをサポートしていませんが、代わりに、通常は OpenID Connect プロバイダーから取得されるローカルで利用可能なキーに依存します。

source: To invoke a GET request, just list the `pets` query parameter multiple times.
ja_jp: GETリクエストを実行するためには、 `pets` クエリパラメーターを複数回リストアップするだけです。

source: To isolate profile-specific dependencies from other profiles, the JDBC drivers could be added as optional dependencies to the application but configured to be included in each profile that requires them, e.g.:
ja_jp: プロファイル固有の依存関係を他のプロファイルから分離するために、JDBC ドライバーをオプションの依存関係としてアプリケーションに追加できますが、それらを必要とする各プロファイルに含まれるように設定されます。以下に例を示します。

source: To know more about how to configure the Artemis JMS client, have a look at https://docs.quarkiverse.io/quarkus-artemis/dev/index.html[the documentation of the extension].
ja_jp: Artemis JMSクライアントの設定方法については、 link:https://docs.quarkiverse.io/quarkus-artemis/dev/index.html[エクステンションのドキュメント] をご覧ください。

source: To know more about how to configure the Artemis JMS client, have a look at https://quarkiverse.github.io/quarkiverse-docs/quarkus-artemis/dev/index.html[the documentation of the extension].
ja_jp: Artemis JMSクライアントの設定方法については、 link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-artemis/dev/index.html[エクステンションのドキュメント]を参照してください。

source: To launch all the containers, building the `producer` and `aggregator` container images, run `docker-compose up --build`.
ja_jp: `producer` と `aggregator` のコンテナーイメージをビルドして、すべてのコンテナーを起動するには、 `docker-compose up --build` を実行します。

source: To learn about custom service discovery and service selection, check:
ja_jp: カスタムのサービスディスカバリとサービスセレクションについては、こちらをご覧ください：

source: To learn about how well-known social providers such as Apple, Facebook, GitHub, Google, Mastodon, Microsoft, Spotify, Twitch, and X (formerly Twitter) can be used with Quarkus OIDC, see xref:security-openid-connect-providers.adoc[Configuring well-known OpenID Connect providers]. See also, xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Authentication mechanisms in Quarkus].
ja_jp: Apple、Facebook、GitHub、Google、Mastodon、Microsoft、Spotify、Twitch、X（旧Twitter）などの有名なソーシャルプロバイダをQuarkus OIDCで使用する方法については、 xref:security-openid-connect-providers.adoc[有名なOpenID Connectプロバイダの設定] を参照してください。 xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Quarkusの認証メカニズム] も参照してください。

source: To learn about how you can protect service applications by using OIDC Bearer token authentication, see the following tutorial:
ja_jp: OIDC ベアラートークン認証を使用してサービスアプリケーションを保護する方法については、次のチュートリアルを参照してください。

source: To learn about how you can protect service applications by using OIDC Bearer token authentication, see the following tutorial: * xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a web application by using OpenID Connect (OIDC) authorization code flow].
ja_jp: OIDC ベアラートークン認証を使用してサービスアプリケーションを保護する方法については、チュートリアルの * xref:security-oidc-bearer-token-authentication-tutorial.adoc[OpenID Connect (OIDC) 認可コードフローを使用した Web アプリケーションの保護] を参照してください。
